students_data = {
    "група": "КН-34",
    "студенти": []
}

# додавання нового студента до словника
def додати_студента(прізвище, ім_я, по_батькові, курс, оцінки):
    новий_студент = {
        "ПІБ": {
            "прізвище": прізвище,
            "ім’я": ім_я,
            "по_батькові": по_батькові
        },
        "курс": курс,
        "оцінки": оцінки  # словник: {"Предмет": оцінка}
    }
    students_data["студенти"].append(новий_студент)

додати_студента("Коваленко", "Олексій", "Іванович", 2, {"Математика": 90, "Програмування": 84})
додати_студента("Попова", "Світлана", "Сергіївна", 3, {"Математика": 93, "Програмування": 87})

import pprint
pprint.pprint(students_data, sort_dicts=False)
